#### FabricationItemFolder Class

---

|  |
| --- |
| Members   See Also |

A fabrication item folder that can contain sub folders and access to the  FabricationItemFile  s contained within.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public class FabricationItemFolder : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class FabricationItemFolder _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class FabricationItemFolder : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB FabricationItemFolder

# See Also

FabricationItemFolder Members

Autodesk.Revit.DB Namespace